openwch/ch32v307/Application/8_uarts_server/RT-Thread/uart_server_rtt/rtthread_V307_net/rtthread_V307_net/drivers/drv_spi.c
#if 0
    /* DMA configuration */
    if (spi_drv->spi_dma_flag & SPI_USING_RX_DMA_FLAG)
    {
        HAL_DMA_Init(&spi_drv->dma.handle_rx);

        __HAL_LINKDMA(&spi_drv->handle, hdmarx, spi_drv->dma.handle_rx);

        /* NVIC configuration for DMA transfer complete interrupt */
        HAL_NVIC_SetPriority(spi_drv->config->dma_rx->dma_irq, 0, 0);
        HAL_NVIC_EnableIRQ(spi_drv->config->dma_rx->dma_irq);
    }

    if (spi_drv->spi_dma_flag & SPI_USING_TX_DMA_FLAG)
    {
        HAL_DMA_Init(&spi_drv->dma.handle_tx);

        __HAL_LINKDMA(&spi_drv->handle, hdmatx, spi_drv->dma.handle_tx);

        /* NVIC configuration for DMA transfer complete interrupt */
        HAL_NVIC_SetPriority(spi_drv->config->dma_tx->dma_irq, 0, 1);
        HAL_NVIC_EnableIRQ(spi_drv->config->dma_tx->dma_irq);
    }
#endif

    LOG_D("%s init done", spi_drv->config->bus_name);
    return RT_EOK;
}

uint8_t HAL_SPI_TransmitReceive(SPI_HandleTypeDef *handle,uint8_t *send_buf,uint8_t *recv_buf,uint16_t send_length,uint16_t timeout)
{
    uint16_t i=0;
    uint8_t ret=0;
   do
   {
        while (SPI_I2S_GetFlagStatus(handle->Instance, SPI_I2S_FLAG_TXE) == RESET)
        {
            i++;
            if(i>timeout){ret=1; break;}
        }
        SPI_I2S_SendData(handle->Instance, *send_buf++);    /* send byte */

        i=0;
        while (SPI_I2S_GetFlagStatus(handle->Instance, SPI_I2S_FLAG_RXNE) == RESET)
        {
            i++;
            if(i>timeout){ret=1; break ;}
        }
        *recv_buf++ =SPI_I2S_ReceiveData(handle->Instance);/* receive byte */
   }while(send_length--);

   return ret;
}
uint8_t HAL_SPI_Transmit(SPI_HandleTypeDef *handle, uint8_t *send_buf,uint16_t send_length, uint16_t timeout)
{
    uint16_t i=0;
    uint8_t ret=0;
    do
    {
        while (SPI_I2S_GetFlagStatus(handle->Instance, SPI_I2S_FLAG_TXE) == RESET)
        {
            i++;
            if(i>timeout){ret=1;  break;}
        }
        SPI_I2S_SendData(handle->Instance, *send_buf++);
    }while(send_length--);
    return ret;
}

uint8_t HAL_SPI_Receive(SPI_HandleTypeDef *handle, uint8_t *recv_buf, uint16_t send_length, uint16_t timeout)
{
    uint16_t i=0;
    uint8_t ret=0;
    do
    {
         while (SPI_I2S_GetFlagStatus(handle->Instance, SPI_I2S_FLAG_RXNE) == RESET)
         {
             i++;
             if(i>timeout){ret=1; break ;}
         }
         *recv_buf++ =SPI_I2S_ReceiveData(handle->Instance);/* receive byte */
    }while(send_length--);

    return ret;
}


static rt_uint32_t spixfer(struct rt_spi_device *device, struct rt_spi_message *message)
{
    rt_uint8_t state;
    rt_size_t message_length, already_send_length;
    rt_uint16_t send_length;
    rt_uint8_t *recv_buf;
    const rt_uint8_t *send_buf;

    RT_ASSERT(device != RT_NULL);
    RT_ASSERT(device->bus != RT_NULL);
    RT_ASSERT(device->bus->parent.user_data != RT_NULL);
    RT_ASSERT(message != RT_NULL);

    struct ch32_spi *spi_drv =  rt_container_of(device->bus, struct ch32_spi, spi_bus);
    SPI_HandleTypeDef *spi_handle = &spi_drv->handle;
    struct ch32_hw_spi_cs *cs = device->parent.user_data;

    if (message->cs_take && !(device->config.mode & RT_SPI_NO_CS))
    {
//        HAL_GPIO_WritePin(cs->GPIOx, cs->GPIO_Pin, GPIO_PIN_RESET);
        GPIO_WriteBit(cs->GPIOx,cs->GPIO_Pin,0);
    }

    LOG_D("%s transfer prepare and start", spi_drv->config->bus_name);
    LOG_D("%s sendbuf: %X, recvbuf: %X, length: %d",
          spi_drv->config->bus_name,
          (uint32_t)message->send_buf,
          (uint32_t)message->recv_buf, message->length);

    message_length = message->length;
    recv_buf = message->recv_buf;
    send_buf = message->send_buf;
    while (message_length)
    {
        /* the HAL library use uint16 to save the data length */
        if (message_length > 65535)
        {
            send_length = 65535;
            message_length = message_length - 65535;
        }
        else
        {
            send_length = message_length;
            message_length = 0;
        }

        /* calculate the start address */
        already_send_length = message->length - send_length - message_length;
        send_buf = (rt_uint8_t *)message->send_buf + already_send_length;
        recv_buf = (rt_uint8_t *)message->recv_buf + already_send_length;
        
        /* start once data exchange in DMA mode */
        if (message->send_buf && message->recv_buf)
        {
            if ((spi_drv->spi_dma_flag & SPI_USING_TX_DMA_FLAG) && (spi_drv->spi_dma_flag & SPI_USING_RX_DMA_FLAG))
            {
//                state = HAL_SPI_TransmitReceive_DMA(spi_handle, (uint8_t *)send_buf, (uint8_t *)recv_buf, send_length);
                state=0;
            }
            else
            {
                state = HAL_SPI_TransmitReceive(spi_handle, (uint8_t *)send_buf, (uint8_t *)recv_buf, send_length, 1000);

            }
        }
        else if (message->send_buf)
        {
            if (spi_drv->spi_dma_flag & SPI_USING_TX_DMA_FLAG)
            {
//                state = HAL_SPI_Transmit_DMA(spi_handle, (uint8_t *)send_buf, send_length);
                state=0;
            }
            else
            {
                state = HAL_SPI_Transmit(spi_handle, (uint8_t *)send_buf, send_length, 1000);
            }

            if (message->cs_release && (device->config.mode & RT_SPI_3WIRE))
            {
                /* release the CS by disable SPI when using 3 wires SPI */
//                __HAL_SPI_DISABLE(spi_handle);

            }
        }
        else
        {
            memset((uint8_t *)recv_buf, 0xff, send_length);
            if (spi_drv->spi_dma_flag & SPI_USING_RX_DMA_FLAG)
            {
//                state = HAL_SPI_Receive_DMA(spi_handle, (uint8_t *)recv_buf, send_length);
                state=0;
            }
            else
            {
                /* clear the old error flag */
//                __HAL_SPI_CLEAR_OVRFLAG(spi_handle);
                state = HAL_SPI_Receive(spi_handle, (uint8_t *)recv_buf, send_length, 1000);
            }
        }

